//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************

//******************************************************************************
// [File] XCradleChsTcgSetup.uni
// [Description] Add XCradle Chinese STR define in this file
// [Author] JSY-ZZP
// [Date] 2021/02/25
//******************************************************************************
/=#
#langdef   x-AMI "x-AMI"
#langdef   en-US "English"
#langdef   zh-chs "中文 (简体)"

#string STR_TCG_FORM                     #language zh-chs "可信计算"
#string STR_TCG_FORM_HELP                 #language zh-chs "可信计算设置"
#string STR_TPM_PROMPT                     #language zh-chs "TPM状态"
#string STR_TCM_PROMPT                     #language zh-chs "TCM状态"
#string STR_TPM_SUPPORT_PROMPT             #language zh-chs "安全设备支持"
#string STR_TCM_SUPPORT_PROMPT             #language zh-chs "安全设备支持"
#string STR_TPM_PASS_PROMPT             #language zh-chs "密码授权"
#string STR_TPM_HELP                       #language zh-chs "启用/禁用安全设备。注意：为了切换设备状态，您的计算机在启动过程中将会重启一次。"
#string STR_TPM_CLEAR                     #language zh-chs "清除TPM"
#string STR_TCM_CLEAR                     #language zh-chs "清除TCM"
#string STR_TPM_NONE                     #language zh-chs "无"
#string STR_TPM_OWNER                     #language zh-chs "启用授权获取"
#string STR_TPM_NOOWNER                 #language zh-chs "禁用授权获取"
#string STR_TPM_ENABLE                     #language zh-chs "启用"
#string STR_TPM_DISABLE                    #language zh-chs "禁用"
#string STR_TPM_ENABLED                    #language zh-chs "启用"
#string STR_TPM_DISABLED                #language zh-chs "禁用"
#string STR_TPMOP_PROMPT                #language zh-chs "挂起操作"
#string STR_TPM20_PROMPT                #language zh-chs "挂起操作"
#string STR_TPM_CONFIGURATION           #language zh-chs "配置"
#string STR_TPM_SETUP_ERROR             #language zh-chs "执行启动要求时的错误报告"
#string STR_TPM_STATUS_INFO             #language zh-chs "当前状态信息"
#string STR_ENABLED_PROMPT              #language zh-chs "TPM启用状态："
#string STR_TCM_ENABLED_PROMPT          #language zh-chs "TCM启用状态"
#string STR_ACTIVATE_PROMPT             #language zh-chs "TPM激活状态："
#string STR_TCM_ACTIVATE_PROMPT         #language zh-chs "TCM激活状态："
#string STR_ENABLED_PROMPT_VALUE        #language zh-chs "N/A, 需要重置"
#string STR_ACTIVATED_PROMPT_VALUE      #language zh-chs "N/A, 需要重置"
#string STR_OWNED_PROMPT_VALUE          #language zh-chs "N/A, 需要重置"
#string STR_ONOFFSTATE_HELP                     #language zh-chs "提供安全设备的当前性能状态"
#string STR_TPMDISABLED                         #language zh-chs "禁用"
#string STR_TPMACTIVATED                        #language zh-chs "已激活"
#string STR_TPMDEACTIVATED                      #language zh-chs "未激活"
#string STR_TPMENABLED                          #language zh-chs "启用"
#string STR_OWNED_OR_UNOWNED_PROMPT        #language zh-chs "TPM所有者状态："
#string STR_TCM_OWNED_OR_UNOWNED_PROMPT        #language zh-chs "TCM所有者状态："
#string STR_OWNED_OR_UNOWNED_HELP        #language zh-chs "显示当前的所有权状态信息：被拥有或者未被拥有"
#string STR_OWNED                               #language zh-chs "被拥有"
#string STR_UNOWNED                             #language zh-chs "未被拥有"
#string STR_TPMOP_HELP                      #language zh-chs "计划安全设备的运行。注意：您的计算机在启动过程中将会重启一次。"
#string STR_TPMSUPPORT_HELP                      #language zh-chs "启用或禁用BIOS对安全设备的支持。操作系统将不会显示安全设备，TCG EFI协议以及INIT1A接口也将不可用。"
#string STR_EMPTY                               #language zh-chs ""
#string STR_TPMHARDWARE                    #language zh-chs "未找到安全设备"
#string STR_TPMSUPP                        #language zh-chs "支持关闭功能"
#string STR_TPMOPTIMIZE                    #language zh-chs "需要重启"
#string STR_TPM_PASS_HELP               #language zh-chs "决定安全设备的状态切换是否需要密码授权"
#string STR_TPM_FORCE_ENABLE            #language zh-chs "强制TPM启用"
#string STR_HASHPOLICY                    #language zh-chs "哈希策略"
#string STR_HASHPOLICY_HELP                #language zh-chs "选择哈希策略。SHA-2最安全，但是有的操作系统可能不支持"
#string STR_TCG2_SPEC_VERSION           #language zh-chs "TPM2.0 UEFI 规范版本 "
#string STR_TCG2_SPEC_VERSION_HELP      #language zh-chs "选择TCG2支持的规范版本，\n\r\n\rTCG_1_2：适应于Win8/Win10兼容模式，\n\r\n\rTCG_2: 适用于Win10及其后继版本，支持新的TCG2协议和事件格式 "
#string STR_TPM_20_DEVICE               #language zh-chs "检测到TPM2.0设备 "
#string STR_TPM_20_PH                   #language zh-chs "平台层级"
#string STR_TPM_20_PH_HELP              #language zh-chs "启用或关闭平台层级"
#string STR_TPM_20_SH                   #language zh-chs "存储层级"
#string STR_TPM_20_SH_HELP              #language zh-chs "启用或禁用存储层级"
#string STR_TPM_20_EH                   #language zh-chs "签注层级"
#string STR_TPM_20_EH_HELP              #language zh-chs "启用或禁用签注层级"
#string STR_TPM_20_REVOKE_TRUST         #language zh-chs "撤销信任"
#string STR_TPM_20_INTERFACE            #language zh-chs "TPM 2.0接口类型"
#string STR_TPM_20_INTERFACE_HELP       #language zh-chs "选择TPM 20设备的通信接口"
#string STR_TPM_20_PH_RANDOMIZATION        #language zh-chs "PH 随机化 "
#string STR_TPM_20_PH_RANDOMIZATION_HELP    #language zh-chs "启用或禁用平台层次结构随机化,勿在生产平台中启用此问题,这是用于开发测试,为支持TXT的生产平台，覆盖ChangePlatformAuth ELINK。"
#string STR_TPM_20_LOCKOUT_RESET              #language zh-chs "重置TPM锁定"
#string STR_TPM_20_LOCKOUT_RESET_HELP     #language zh-chs "允许BIOS去通过TPM清除命令重置TPM锁定。注意：这将清除你的TPM。你可以使用TPM中存储的密钥和其他密码。"
#string STR_DEVICE_TYPE_PROMPT          #language zh-chs "设备选择"
#string STR_TPM_AUTO                    #language zh-chs "自动"
#string STR_TPM_DEVICE_TYPE_HELP        #language zh-chs "TPM 1.2 仅支持TPM 1.2 设备，TPM 2.0 仅支持TPM 2.0 设备，自动选项两个设备都支持（自动设置默认支持TPM 2.0，如果找不到TPM 2.0 则寻找TPM 1.2 设备）。"
#string STR_TPM_ACTIVE_PCR_BANKS        #language zh-chs "有效的PCR库"
#string STR_TPM_ACTIVE_PCR_BANKS_VALUE      #language zh-chs "N/A, 需要重置"
#string STR_TPM_SUPPORTED_PCR_BANKS            #language zh-chs "可支持的PCR库"
#string STR_TPM_SUPPORTED_PCR_BANKS_VALUE   #language zh-chs "N/A, 需要重置"
#string STR_TPM_SHA1_PCRBANK_ENABLE            #language zh-chs "SHA-1 PCR库"
#string STR_TPM_SHA1_PCRBANK_ENABLE_HELP       #language zh-chs "启用或禁用SHA-1 PCR库"
#string STR_TPM_SHA256_PCRBANK_ENABLE          #language zh-chs "SHA256 PCR库"
#string STR_TPM_SHA256_PCRBANK_ENABLE_HELP     #language zh-chs "启用或禁用SHA256 PCR库。"
#string STR_TPM_SHA384_PCRBANK_ENABLE          #language zh-chs "SHA384 PCR库"
#string STR_TPM_SHA384_PCRBANK_ENABLE_HELP     #language zh-chs "启用或禁用SHA384 PCR库"
#string STR_TPM_SHA512_PCRBANK_ENABLE          #language zh-chs "SHA512 PCR库"
#string STR_TPM_SHA512_PCRBANK_ENABLE_HELP  #language zh-chs "启用或禁用SHA512 PCR库"
#string STR_TPM_SM3_PCRBANK_ENABLE          #language zh-chs "SM3_256 PCR库"
#string STR_TPM_SM3_PCRBANK_ENABLE_HELP       #language zh-chs "启用或禁用SM3_256 PCR库"
#string STR_PPI_SPEC_VERSION                   #language zh-chs "物理存在规范版本"
#string STR_PPI_SPEC_VERSION_HELP            #language zh-chs "选择告知OS支持的PPI规范版本是1.2或1.3。注意一些HCK测试可能不支持1.3版本。"
#string STR_TPM_FW_VERSION_STRING           #language zh-chs "固件版本："
#string STR_TPM_FW_VENDOR_STRING            #language zh-chs "厂商："
#string STR_BLOCK_SID_PROMPT                #language zh-chs "禁用 Block Sid"
#string STR_BLOCK_SID_PROMPT_HELP           #language zh-chs " 重写以允许TCG存储设备中的SID身份验证。"


//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************